In [16]:
#import necessary libraries
import pandas as pd

In [6]:
#declare movie rating dataframes: ratings from 1 to 5 (star * rating)
df_movie_rating = pd.DataFrame({'movie 1':[5,4,3,3,2,1], 'movie 2':[4,5,2,3,4,2]},
                               index=['Tom','Jeff','Peter','Ram','Ted','Paul'])

In [7]:
df_movie_rating

       movie 1  movie 2
Tom          5        4
Jeff         4        5
Peter        3        2
Ram          3        3
Ted          2        4
Paul         1        2

In [8]:
#define function to replace movie grade with characters
def movie_grade(rating):
    if rating==5:
        return 'A'
    if rating==4:
        return 'B'
    if rating==3:
        return 'C'
    else:
        return 'F'

In [10]:
#test function
movie_grade(5)

'A'

In [13]:
#apply function to dataset - using applymap
df_movie_rating.applymap(movie_grade)

      movie 1 movie 2
Tom         A       B
Jeff        B       A
Peter       C       F
Ram         C       C
Ted         F       B
Paul        F       F

In [14]:
print("Data operations with different statistical functions")

Data operations with different statistical functions

In [20]:
df_test_scores =pd.DataFrame({'Test1':[95,84,73,88,82,61],'Test2':[74,85,82,73,77,79]},
                              index=['Jack','Lewis','Patrick','Rich','Kelly','Paula'])

In [21]:
df_test_scores.describe()

           Test1      Test2
count   6.000000   6.000000
mean   80.500000  78.333333
std    11.979149   4.633213
min    61.000000  73.000000
25%    75.250000  74.750000
50%    83.000000  78.000000
75%    87.000000  81.250000
max    95.000000  85.000000

In [22]:
df_test_scores.max()

Test1    95
Test2    85
dtype: int64

In [23]:
df_test_scores.min()

Test1    61
Test2    73
dtype: int64

In [24]:
df_test_scores.mean()

Test1    80.500000
Test2    78.333333
dtype: float64

In [25]:
df_test_scores.std()

Test1    11.979149
Test2     4.633213
dtype: float64

In [26]:
print("Operate data using the groupby function")

Operate data using the groupby function

In [33]:
df_president_name = pd.DataFrame({'first_name':['George','Bill','Ronald','Jimmy','George'], 
                     'last_name':['Bush','Clinton','Regan','Carter','Washington']})
df_president_name

  first_name   last_name
0     George        Bush
1       Bill     Clinton
2     Ronald       Regan
3      Jimmy      Carter
4     George  Washington

In [37]:
grouped=df_president_name.groupby('first_name')

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x00000179F0D0E2B0>

In [38]:
grp_data=grouped.get_group('George')
grp_data

  first_name   last_name
0     George        Bush
4     George  Washington

In [40]:
#sort data in a dataframe
df_president_name.sort_values('first_name')

  first_name   last_name
1       Bill     Clinton
0     George        Bush
4     George  Washington
3      Jimmy      Carter
2     Ronald       Regan